{"hobbies": [{"hobby": "Coffee", "description": "I have a deep appreciation for coffee, enjoying the process of brewing different types of coffee and exploring various brewing methods. I also like visiting local coffee shops to try new flavors and learn about coffee culture."}, {"hobby": "Running/Working Out", "description": "I am passionate about maintaining a healthy lifestyle through regular running and working out. I enjoy setting fitness goals, participating in local races, and exploring new workout routines to challenge myself physically."}, {"hobby": "Reading", "description": "I am an avid reader with a broad interest in various genres, including fiction, non-fiction, and technical literature. I enjoy immersing myself in different worlds and gaining new perspectives through books."}, {"hobby": "Mechanical Keyboards", "description": "I have a fascination with mechanical keyboards, enjoying the process of customizing and building them. I appreciate the tactile feedback and unique typing experience they offer, and I often participate in online communities to share knowledge and ideas."}, {"hobby": "Learning New Languages", "description": "I am enthusiastic about learning new languages, enjoying the challenge of understanding different linguistic structures and cultures. This hobby enhances my communication skills and broadens my global perspective."}, {"hobby": "Equities and Derivatives Trading", "description": "I have a strong interest in equities and derivatives trading, including stock options, futures, and forex. I enjoy analyzing market trends, developing trading strategies, and staying updated with financial news to make informed investment decisions."}]}
{"education": [{"institution": "Angelo State University", "location": "San Angelo, TX", "degree": "M.S. in Computer Science", "expected_graduation": "Dec 2024", "concentrations": ["Data Science", "Machine Learning"], "coursework": ["Data Science", "Machine Learning", "Artificial Intelligence", "Deep Learning", "Statistics"]}, {"institution": "South Texas College", "location": "McAllen, TX", "degree": "B.A.T in Computer Information Technology", "graduation_date": "Dec 2023", "concentrations": ["Software Development", "Information Systems/Security"], "coursework": ["Data Structures and Algorithms", "Software Security", "Web Development", "Database Management", "System Design", "Networking"]}]}
{"research_interests": [{"topic": "Quantitative Trading/Finance", "description": "I want to research the development and implementation of algorithmic trading strategies using quantitative analysis. This includes studying financial models, risk management techniques, and the use of machine learning to predict market trends and optimize trading decisions."}, {"topic": "Robotics with AI", "description": "My research interests in this area focus on the integration of artificial intelligence with robotics to enhance automation and decision-making processes. This involves exploring machine learning algorithms for robot perception, navigation, and manipulation, as well as human-robot interaction and collaborative robotics."}, {"topic": "Genetic Algorithms", "description": "I aim to investigate the application of genetic algorithms for solving complex optimization problems. This includes studying their effectiveness in various domains such as machine learning, scheduling, and design optimization, as well as improving their performance through hybridization with other evolutionary algorithms."}, {"topic": "Quantum Computing", "description": "My research in quantum computing focuses on exploring quantum algorithms and their potential to solve problems that are intractable for classical computers. This includes studying quantum error correction, quantum cryptography, and the application of quantum computing in fields such as material science, cryptography, and artificial intelligence."}, {"topic": "NLP/LLM", "description": "I want to research advancements in natural language processing (NLP) and large language models (LLMs). This involves exploring techniques for improving language understanding, generation, and translation, as well as applications in information retrieval, sentiment analysis, and conversational AI."}, {"topic": "Generative AI", "description": "My interests in generative AI include studying models and techniques for generating high-quality synthetic data, images, and text. This encompasses researching generative adversarial networks (GANs), variational autoencoders (VAEs), and their applications in creative fields such as art, music, and content creation."}]}
{"professional_experiences": [{"job_title": "Line Cook", "company": "BJ's Restaurant and Brewhouse", "timeframe": "January 2023 - August 2023", "responsibilities": ["Prepared and cooked menu items in accordance with recipes and quality standards.", "Maintained cleanliness and organization of the kitchen and workstations.", "Collaborated with kitchen staff to ensure timely and efficient service.", "Adhered to food safety and sanitation guidelines.", "Assisted in inventory management and restocking of supplies."]}, {"job_title": "Cook/Shift Lead", "company": "Panda Express", "timeframe": "August 2023 - Current", "responsibilities": ["Oversaw kitchen operations and ensured high standards of food quality and presentation.", "Supervised and trained new kitchen staff members.", "Managed shift schedules and coordinated staff assignments.", "Monitored inventory levels and placed orders for necessary supplies.", "Maintained a clean and safe working environment, adhering to health and safety regulations."]}]}
{"education": [{"institution": "Angelo State University", "location": "San Angelo, TX", "degree": "M.S. in Computer Science", "expected_graduation": "Dec 2024", "concentrations": ["Data Science", "Machine Learning"], "coursework": ["Data Science", "Machine Learning", "Artificial Intelligence", "Deep Learning", "Statistics"]}, {"institution": "South Texas College", "location": "McAllen, TX", "degree": "B.A.T in Computer Information Technology", "graduation_date": "Dec 2023", "concentrations": ["Software Development", "Information Systems/Security"], "coursework": ["Data Structures and Algorithms", "Software Security", "Web Development", "Database Management", "System Design", "Networking"]}], "experience": [{"company": "Barrios", "location": "Corpus Christi, TX", "title": "Team Member", "duration": "Mar 2024 – May 2024", "responsibilities": ["Leveraged supervised learning techniques, including K-nearest Neighbors (KNN) regression, to predict consumables usage with remarkable accuracy, achieving a mean squared error (MSE) of 0 and an R-squared score (R2) of 1 on test data.", "Applied unsupervised learning methodologies such as K-means clustering and hierarchical clustering to uncover hidden patterns in unlabeled data, providing valuable insights into consumables usage patterns and optimizing inventory management strategies.", "Demonstrated strong data analysis and visualization skills by effectively communicating results through visual representations such as scatter plots and dendrograms, facilitating data-driven decision-making for future consumption predictions and resource planning."], "project_link": "https://github.com/CodeByRalph/ISS_Consumable_Usage"}, {"company": "Panda Express", "location": "Corpus Christi, TX", "title": "Cook / Shift Lead", "duration": "Aug 2023 – Current", "responsibilities": ["Oversees daily operation, ensures service and food quality, implements health and safety standards, monitor inventory and ordering supplies.", "Handles customers concerns and feedback, and mentors new employees."]}], "projects": [{"title": "UCKG", "location": "Corpus Christi, TX", "role": "Researcher", "duration": "May 2024 - Current", "responsibilities": ["Investigating UCKG's potential integration within intelligent cyber operations framework to enhance data analysis, threat detection, and response strategies.", "Exploring how UCKG methodologies can be adapted to optimize cyber threat intelligence gathering, leveraging its principles for real-time risk assessment and mitigation.", "Assessing the feasibility of incorporating UCKG principles into automated decision-making processes within cyber defense systems, aiming to enhance adaptability and resilience against evolving threats."]}, {"title": "Stock Predictor", "location": "Corpus Christi, TX", "role": "Sole Developer", "duration": "Feb 2024", "responsibilities": ["Trained mathematical models to predict stock price trends using Naive Bayes, Neural Networks, and Linear Regression Time Series algorithms.", "Scripted the predictive stock price model and obtained a prediction accuracy of 90.07%."], "project_link": "https://github.com/CodeByRalph/Stock_Prediction"}], "personal_info.name": "Ralph A. Stout", "personal_info.email": "Ralph.stout14@icloud.com", "personal_info.phone": "(571) 991-1291", "personal_info.linkedin": "http://www.linkedin.com/in/ralphstout", "personal_info.github": "https://github.com/CodeByRalph", "skills.programming_languages": ["Python", "JavaScript", "HTML/CSS", "SQL", "MongoDB", "Node.js", "React.js", "C++"], "skills.tools": ["Jupyter Notebooks", "Git", "AWS", "REST API"]}
{"skills": [{"name": "Python", "category": "Programming Languages", "description": "Experienced in Python for data analysis, web development, and scripting. Used extensively in machine learning projects."}, {"name": "Docker", "category": "DevOps", "description": "Knowledgeable in using Docker for containerization, ensuring consistent environments across different stages of development."}, {"name": "Next.js", "category": "Web Development Frameworks", "description": "Skilled in developing server-side rendered React applications with Next.js, improving performance and SEO."}, {"name": "NestJS", "category": "Web Development Frameworks", "description": "Experienced in building scalable and maintainable server-side applications with NestJS, leveraging Typescript."}, {"name": "Node.js", "category": "Programming Languages", "description": "Proficient in Node.js for building fast and scalable network applications, including RESTful APIs."}, {"name": "Machine Learning", "category": "Data Science", "description": "Experienced in building and deploying machine learning models using libraries like scikit-learn and TensorFlow."}, {"name": "Deep Learning", "category": "Data Science", "description": "Skilled in deep learning techniques, using frameworks like TensorFlow for complex model building."}, {"name": "MySQL", "category": "Databases", "description": "Proficient in using MySQL for relational database management, including complex queries and database design."}, {"name": "MongoDB", "category": "Databases", "description": "Experienced in using MongoDB for NoSQL database management, suitable for handling unstructured data."}, {"name": "Git", "category": "Version Control", "description": "Proficient in using Git for version control, ensuring efficient collaboration and code management."}, {"name": "REST API", "category": "Web Development", "description": "Experienced in designing and implementing RESTful APIs for web services, ensuring robust and scalable communication."}, {"name": "Tailwind CSS", "category": "Web Development", "description": "Skilled in using Tailwind CSS for utility-first CSS framework, creating responsive and modern web designs."}, {"name": "Linux", "category": "Operating Systems", "description": "Proficient in using Linux for development and server management, with experience in shell scripting and system administration."}, {"name": "Windows", "category": "Operating Systems", "description": "Experienced in using Windows for development and daily tasks, familiar with various tools and environments."}, {"name": "macOS", "category": "Operating Systems", "description": "Proficient in using macOS for development, leveraging Unix-based environment for efficient workflows."}, {"name": "React Native", "category": "Mobile Development", "description": "Skilled in developing cross-platform mobile applications using React Native, ensuring a native look and feel."}, {"name": "Responsive Web Design", "category": "Web Development", "description": "Experienced in creating responsive web designs that work seamlessly across different devices and screen sizes."}, {"name": "HTML", "category": "Web Development", "description": "Proficient in HTML for structuring web content, ensuring semantic and accessible web pages."}, {"name": "Large Language Models", "category": "Artificial Intelligence", "description": "Experienced in working with large language models like GPT-3 and Llama3 for natural language processing tasks."}, {"name": "Networking", "category": "Information Technology", "description": "Knowledgeable in networking concepts and protocols, ensuring secure and efficient communication between systems."}, {"name": "Figma", "category": "Design Tools", "description": "Skilled in using Figma for UI/UX design, creating interactive prototypes and design systems."}, {"name": "Data Science", "category": "Data Science", "description": "Experienced in data science techniques, including data analysis, visualization, and statistical modeling."}, {"name": "UI/UX", "category": "Design", "description": "Proficient in UI/UX design principles, ensuring user-centric and visually appealing interfaces."}, {"name": "Redis", "category": "Databases", "description": "Experienced in using Redis for in-memory data storage, optimizing performance for caching and real-time applications."}, {"name": "Prisma", "category": "Web Development", "description": "Skilled in using Prisma as an ORM for Node.js, ensuring efficient database management and queries."}]}
